tutorials/fluidSolidInteraction/RobinFsi3dTube/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface    Aitken;

AitkenCoeffs
{
    solidPatch          inner-wall;
    fluidPatch          wall;

	// Initial relaxation factor
    relaxationFactor    0.4;

    outerCorrTolerance  1e-6;
    nOuterCorr          100;

    interpolatorUpdateFrequency 0;
    interfaceDeformationLimit   0;

    coupled yes;
}

// ************************************************************************* //
